src/InformationRegisters/ДатыРасписаний/ДатыРасписаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыРасписаний</name>
  <resources>
    <name>АктуальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютаДохода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаРасхода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяОперация</name>
    <type>
      <types>DocumentRef.ОбменВалюты</types>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.МыВзялиВДолг</types>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.МыДалиВДолг</types>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Расход</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </resources>
  <resources>
    <name>Пропустить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецРасписания</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОперацииШаблонов/ОперацииШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОперацииШаблонов</name>
  <resources>
    <name>ПлановаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.ОбменВалюты</types>
      <types>DocumentRef.ВводИзменениеОстатка</types>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.МыВзялиВДолг</types>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.МыДалиВДолг</types>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Расход</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>DocumentRef.ОбменВалюты</types>
      <types>DocumentRef.ВводИзменениеОстатка</types>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.МыВзялиВДолг</types>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.МыДалиВДолг</types>
      <types>DocumentRef.Перемещение</types>
      <types>DocumentRef.Расход</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДатыРасписаний/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли; 
	
	Если НЕ Отказ И Замещение И ЭтотОбъект.Количество() = 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ВладелецРасписания", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ВладелецРасписания.Значение), ЭтотОбъект.Отбор.ВладелецРасписания.Значение, ""));
			Запрос.УстановитьПараметр("ПлановаяДата", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ПлановаяДата.Значение),  ЭтотОбъект.Отбор.ПлановаяДата.Значение, ""));
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДатыРасписаний.ВладелецРасписания,
			|	ДатыРасписаний.ПлановаяОперация
			|ИЗ
			|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
			|ГДЕ
			|	(&ВладелецРасписания = """"
			|			ИЛИ ДатыРасписаний.ВладелецРасписания = &ВладелецРасписания)
			|	И (&ПлановаяДата = """"
			|			ИЛИ ДатыРасписаний.ПлановаяДата = &ПлановаяДата)
			|	И ДатыРасписаний.ПлановаяОперация <> Неопределено";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.ВладелецРасписания) И ЗначениеЗаполнено(Выборка.ПлановаяОперация) Тогда
					Запись = РегистрыСведений.ОперацииШаблонов.СоздатьМенеджерЗаписи();
					Запись.Шаблон   = Выборка.ВладелецРасписания;
					Запись.Операция = Выборка.ПлановаяОперация;
					Запись.Прочитать();
					Если Запись.Выбран() Тогда
						Запись.Удалить();
					КонецЕсли; 
				КонецЕсли; 
			
			КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	СписокОпераций = Новый Массив;
	
	Если НЕ Отказ И ЭтотОбъект.Количество() > 0 Тогда
		
		Для Каждого ЗаписьЭтогоОбъекта Из ЭтотОбъект Цикл
			
			Если ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.АктуальнаяДата) И ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.ПлановаяОперация) Тогда
				ЗаписьОперацииШаблона = РегистрыСведений.ОперацииШаблонов.СоздатьМенеджерЗаписи();
				ЗаписьОперацииШаблона.Шаблон       = ЗаписьЭтогоОбъекта.ВладелецРасписания;
				ЗаписьОперацииШаблона.Операция     = ЗаписьЭтогоОбъекта.ПлановаяОперация;
				ЗаписьОперацииШаблона.ПлановаяДата = ЗаписьЭтогоОбъекта.ПлановаяДата;
				ЗаписьОперацииШаблона.Записать(Истина);
				Если ЗаписьЭтогоОбъекта.ВладелецРасписания <> ЗаписьЭтогоОбъекта.ПлановаяОперация Тогда
					СписокОпераций.Добавить(ЗаписьЭтогоОбъекта.ПлановаяОперация);
				КонецЕсли;
			КонецЕсли; 
			
		КонецЦикла; 
		
		// Поскольку операции добавлены в даты шаблона, они не могут оставаться запланированными без шаблона
		ПлановыеОперации.УдалитьДатуОперацийЗапланированныхБезШаблона(СписокОпераций);
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
